package com.moutum.csmp.dao;

import java.util.List;

import com.moutum.csmp.base.DaoSupport;
import com.moutum.csmp.domain.Group;

/************************************************************************************
 * @Title        : GroupDao.java
 * @Description : 
 * @Author       : BianWeiqing
 * @DateTime     : 2015年5月15日 下午5:58:33
 * @Copyright    : 2015 Moutum All Rights Reserved
 * @version      : V1.0
 ************************************************************************************/
public interface GroupDao extends DaoSupport<Group>
{

    /********************************************************************************
     * 根据父群组ID获取群组集合
     * @param fid
     * @return
     ********************************************************************************/
    List<Group> getByFid(int fid);

    /********************************************************************************
     * 查询父群组ID为指定参数或为0(父群组ID为0表示该群组无父群组)的群组即和
     * @param groupId
     * @return
     ********************************************************************************/
    List<Group> getGroupParent(int groupId);
    
    /********************************************************************************
     * 查询无父群组的所有群组(除系统群组外)的集合
     * @return
     ********************************************************************************/
    List<Group> getNoParentGroup();

    /********************************************************************************
     * 更新新子群组的父ID为指定参数
     * @param cgroupId
     * @param ids
     ********************************************************************************/
    void modifyAddParentId(int cgroupId, Integer[] ids);

    /********************************************************************************
     * 将父群组ID为指定参数的群组的父群组ID设置为0，即使之成为无父群组的群组
     * @param cgroupId
     ********************************************************************************/
    void modifyCancelParentId(int cgroupId);

}

