<%@ page language="java" import="java.util.*" pageEncoding="utf-8"%>
<%@ include file="../taglib.jsp"%>

<html>
  <head>
    <title>注册协议</title>
  
    <script type="text/javascript" src="${pageContext.request.contextPath}/js/jquery-1.8.2.min.js"></script>
    <script type="text/javascript" src="${pageContext.request.contextPath}/js/jquery.js"></script>
    <link rel="stylesheet" type="text/css" href="${pageContext.request.contextPath}/css/t_style.css">
	
 
  </head>
  <body>  
     <div >
         <span style="font-size: 16px; font-weight: bold;">一、甲方权利与义务</span><br/>
          <span style="font-size: 14px; font-weight: bold;">（一）	安全相关</span><br/>
                   乙方及交易对方使用同意并认可，可能由于银行本身系统问题、银行相关作业网络连线问题或其他不可抗拒因素，造成协议规定服务无法提供，对此甲方不承担任何责任。<br/>
				A.乙方及交易对方同意，基于运行和交易安全的需要，甲方可以暂时停止提供或者限制上述服务部分功能,或提供新的功能，在任何功能减少、增加或者变化时，只要乙方及交易对方仍然使用上述服务，
				 <br/> 表示乙方仍然同意本协议或者变更后的协议。<br/>
				B.甲方有权了解乙方及交易对方使用甲方产品或服务的真实交易背景及目的，乙方及交易对方应如实提供甲方所需的真实、全面、准确的信息；如果甲方有合理理由怀疑乙方或交易对方提供虚假交易信息的，
				<br/>甲方有权暂时或永久限制乙方或交易对方所使用的产品或服务的部分或全部功能。<br/>
				C.乙方同意，甲方有权国家法律或和行政法规所赋予权力的有权机关的要求对乙方的个人信息以及在交易平台的资金、交易及账户等进 行查询、冻结或扣划。<br/>
				    为有效保障乙方使用甲方提供服务时的合法权益，乙方理解并同意接受以下规则：<br/>
				A.一旦乙方使用上述服务，乙方即授权甲方代理乙方在乙方及（或）乙方指定人符合指定条件或状态时，支付款项给乙方指定人，或收取乙方指定人支付给乙方的款项。<br/>
				B.甲方通过以下三种方式接受来自乙方的指令：其一，乙方在本网站或其他可使用上述服务的网站或软件上通过以乙方的交易平台账户名及密码或数字证书等安全产品登录交易平台账户
				<br/>并依照本服务预设流程所修改或确认的交易状态或指令；其二，乙方及交易方通过注册时作为该账户名称或者与该账户绑定的手机或其他专属于乙方及交易方的通讯工具
				<br/>（以下合称该手机）号码向本系统发送的信息（短信 或电话等）回复；其三，乙方及交易对方通过乙方注册时作为该账户名称或者与该账户名称绑定的其他硬件、终端、软件、代号、编码、代码、
				<br/>其他账户名等有形体或无形体向本系统发送的信息。无论乙方及交易对方通过以上三种方式中的任一种向甲方发出指令，都不可撤回或撤销，且成为甲方代理乙方支付或收取款项或进行其他账户操作的唯一指令，
				<br/>视为乙方或交易对方本人的指令，乙方或交易对方应当对甲方忠实执行上述指令产生的任何结果承担责任。本协议所称绑定，指乙方的交易平台账户与本条上述所称有形体或无形体存在对应的关联关系，
				<br/>这种关联关系使得交易平台的某些服务功能得以实现， 且这种关联关系有时使得这些有形体或无形体能够作为本系统对乙方及交易对方的交易平台账户的识别和认定依据。除本协议另有规定外，
				<br/>乙方与交易对方发生交易纠纷时，由乙方与交易对方协商或借助法律仲裁决定将争议款项的全部或部分支付给交易一方或双方。<br/>
				C. 乙方如果需要向交易对方交付货物，应根据交易状态页面（该手机接收到的信息）显示的买方地址，委托有合法经营资格的承运人将货物直接运送至对方或其指定收货人，
				<br/>并要求对方或其委托的交易对方（该交易对方应当提供对方的授权文件并出示相应的身份证件）在收货凭证上签字确认，因货物延迟送达或在送达过程中的丢失、损坏，
				<br/>甲方不承担任何责任，应由乙方与交易对方自行处理。<br/>
				D.甲方对乙方所交易的标的物不提供任何形式的鉴定、证明的服务。除本协议另有规定外，如乙方与交易对方发生交易纠纷，
				<br/>乙方授权由甲方根据本协议及本网站上载明的各项规则进行处理。乙方或交易对方为解决纠纷而支出的通讯费、文件复印费、
				<br/>鉴定费等均由乙方或交易对方自行承担。因市场因素致使商品涨价跌价而使任何一方得益或者受到损失而产生的纠纷甲方不予处理。<br/>
				E.甲方会将乙方委托甲方代收或代付的款项，严格按照法律法规或有权机关的监管要求进行管理；除本协议另有规定外，不作任何其他非乙方指示的用途。<br/>
          <span style="font-size: 14px; font-weight: bold;"> （二）系统中断或故障</span><br/>
                  甲方系统因下列状况无法正常运作，使乙方无法使用各项服务时，甲方不承担损害赔偿责任，该状况包括但不限于：<br/>
				1.甲方在本网站公告之系统停机维护期间。<br/>
				2.电信设备出现故障不能进行数据传输的。<br/>
				3.因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成甲方系统障碍不能执行业务的。<br/>
				4.由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。<br/>
         <span style="font-size: 16px; font-weight: bold;"> 二、乙方权利与义务</span><br/>
             <span style="font-size: 14px; font-weight: bold;">（一） 注册相关</span><br/>
                  除本协议另有规定或相关产品另有规则外，乙方及交易对方须在指定网站卖炭网（http://fanyangxi.gicp.net/csmp/index）注册并取得乙方提供的交易账户。
                 <br/> 并且按照甲方要求提供相关信息完成激活后方可使用上述服务。对此乙方同意：<br/>
				A.乙方及交易对方按照甲方要求准确提供最新及完整的企业信息及相关资料。若甲方有合理理由怀疑乙方及交易对方提供的企业信息与相关资料错误、
				<br/>不实、过时或不完整的，甲方有权暂停或终止向乙方提供部分或全部服务。甲方对此不承担任何责任，乙方或交易对方将承担因此产生的任何直接或间接支出。
				<br/>若因国家法律法规、部门规章或监管机构的要求，甲方需要乙方及交易对方补充提供任何相关资料时，如乙方及交易对方不能及时配合提供，
				<br/>甲方有权暂停或终止向乙方及交易对方提供部分或全部服务。<br/>
				B.乙方及交易对方应当准确提供并及时更新电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便甲方与乙方及交易对方进行及时、
				<br/>有效联系。乙方及交易对方各自完全独自承担因通过这些联系方式无法取得联系而导致的任何损失或增加任何费用等不利后果。乙方及交易对方理解并同意，
				<br/>乙方及交易对方有义务保持提供的联系方式的有效性。<br/>
             <span style="font-size: 14px; font-weight: bold;">（二） 账户安全</span><br/>
                  乙方及交易对方将对各自账户及密码、校验码进行的一切操作及言论负完全的责任，乙方及交易对方同意：<br/>
				A.甲方通过乙方的交易平台登录名和密码识别乙方及交易对方的指示，乙方及交易对方应当妥善保管各自的交易平台登录名和密码及身份信息，对于因密码泄露、
				<br/>身份信息泄露所致的损失，由乙方或交易对方自行承担。乙方保证不向其他任何人泄露乙方及交易对方的交易平台登录名及密码以及身份信息，
				<br/>亦不使用其他任何人的交易平台登录名及密码。<br/>
				B.基于计算机端、手机端以及使用其他电子设备的用户使用习惯，甲方应在乙方及交易对方使用具体产品时设置不同的账户登录模式及采取不同的措施识别乙方及交易对方的身份。<br/>
				C.乙方及交易对方同意，如发现有他人冒用或盗用乙方及交易对方的交易平台登录名及密码或任何其他未经合法授权之情形，或发生与交易平台账户
				<br/>关联的手机或其他设备遗失或其他可能危及到交易平台账户资金安全情形时，应立即以有效方式通知甲方，向甲方申请暂停相关服务。
				<br/>乙方及交易对方不可撤销地授权甲方将前述情况同步至甲方网站，以保障乙方及交易对方的合法权益。及确保乙方及交易对方在使用甲方支付功能结束时，
				<br/>以正确步骤退出界面。甲方无需对因乙方及交易对方未能遵守本款约定而发生的任何损失、损毁及其他不利后果负责。<br/>
				D.乙方及交易对方确认，乙方及交易对方应自行对己方的交易平台账户负责，只有己方被授权人方可使用该账户。该账户不可转让、不可赠与、不可继承，
				<br/>但账户内的相关财产权益可被依法继承。在乙方及交易对方决定不再使用该账户时，应将该账户内的可用款项全部提现或者转账到其他账户，并按甲方规定流程向甲方申请注销该账户。<br/>
             <span style="font-size: 14px; font-weight: bold;">（三） 注销相关</span><br/>
                  在需要终止使用上述服务时,乙方及交易对方可以申请注销己方的交易平台账户,乙方同意:<br/>
				A.乙方及交易对方所申请注销的交易平台账户应当是乙方及交易对方依照本协议的约定注册并由甲方提供给乙方及交易对方的账户。乙方及交易对方应当依照甲方规定的程序进行交易平台账户注销。<br/>
				B.交易平台账户注销将导致甲方终止为乙方或交易对方提供上述服务，本协议约定的双方的权利义务终止（依本协议其他条款另行约定不得终止的或依其性质不能终止的除外），
				<br/>同时还可能对于该账户产生如下结果：<br/>
				1.乙方及交易对方申请注销的交易平台账户应当不存在任何由于该账户被注销而导致的未了结的合同关系与其他基于该账户的存在而产生或维持的权利义务，
				<br/>及甲方认为注销该账户会由此产生未了结的权利义务而产生纠纷的情况。<br/>
				2.任何银行卡将不能适用该账户内的支付或提现服务。<br/>
				3.如果乙方及交易对方申请注销的交易账户一旦注销成功，将不再予以恢复。<br/>
				4.乙方理解并同意，乙方若存在欺诈、发布或销售伪劣商品、侵犯他人合法权益或其他严重违反任一国家法规行为时，甲方有权终止全部或部分服务。<br/>
             <span style="font-size: 14px; font-weight: bold;">（四）法律相关</span><br/>
					A.乙方在使用上述服务时应遵守中华人民共和国相关法律法规、乙方所在国家或地区之法令及相关国际惯例，不将上述服务用于任何非法目的（包括用于禁止或限制交易物品的交易），
					<br/>也不以任 何非法方式使用上述服务。<br/>
					B.乙方不得利用上述服务从事侵害他人合法权益之行为，否则甲方有权拒绝提供上述服务，且乙方应承担所有相关法律责任，因此导致甲方或甲方雇员受损的，乙方应承担赔偿责任。上述行 为包括但不限于：<br/>
					1、侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。<br/>
					2、违反依法定或约定之保密义务。<br/>
					3、冒用他人名义使用上述服务。<br/>
					4、从事不法交易行为，如洗钱、恐怖融资、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他甲方认为不得使用上述服务进行交易的物品等。<br/>
					5、提供赌博资讯或以任何方式引诱他人参与赌博。<br/>
					6、非法使用他人银行账户（包括信用卡账户）或无效银行账号（包括信用卡账户）交易。<br/>
					7、违反《银行卡业务管理办法》使用银行卡，或利用信用卡套取现金（以下简称套现）。<br/>
					8、进行与乙方或交易对方宣称的交易内容不符的交易，或不真实的交易。<br/>
					9、从事任何可能含有电脑病毒或是可能侵害上述服务系统、资料之行为。<br/>
         
     </div>
  </body>
</html>